#   Изучение функции print()
#   У функции есть такие параметры как end и sep //sep=separator(разделитель)
#   Если мы выведем переменные или текст через запятую, то между этими значениями будет пробел, так как в sep по умолчанию стоит пробел, т.е. sep=' '

print('Пр','ив','ет', sep='', end=' --------- ')    #end - отвечает за конец строки, например, перенос на след. строку. Как захочет программист
print('это','приветствие', sep=' ') #sep - отвечает за символы между переменными/значениями написанными внутри вызова функции


#   Нарисовать прямоугольник 4 на 17

# print()
# print('*'*17)
# print('*','*', sep=(' '*15))
# print('*','*', sep=(' '*15))
# print('*'*17)